{
  "backend/main.mo": "Main Motoko actor defining CustomerProfile and Booking types, access-controlled endpoints for customer registration, profile management, and booking CRUD operations on the ICP backend.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (cinematic theme, landing page, pricing sections, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-sentence descriptions of every frontend source file, serving as a quick reference for the purpose of each component, hook, and page.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark theme tokens (background, foreground, card, sidebar, chart colors, etc.).",
  "frontend/index.html": "Minimal HTML entry point titled 'Himachali Editor' that mounts the React app at the #root div and loads the main.tsx module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for LandingPage (/) and DashboardPage (/dashboard), wrapped with a Sonner Toaster.",
  "frontend/src/components/AboutSection.tsx": "About section displaying brand story copy alongside a 2×2 grid of animated stat cards (projects, experience, clients, location) with gold decorative accents.",
  "frontend/src/components/BookingHistoryCard.tsx": "Card component that renders a single booking's service name, ID, preferred date, creation timestamp, and a color-coded status badge (pending/confirmed/completed).",
  "frontend/src/components/BookingModal.tsx": "A dialog modal for booking a service that handles unauthenticated users (prompts login), form submission with date input, and displays a success confirmation state.",
  "frontend/src/components/Footer.tsx": "Site footer displaying brand info, a services list, package pricing tiers, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with logo, smooth-scroll nav links, a Dashboard link, login button, and a responsive mobile hamburger menu.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, headline, tagline, and CTA buttons that scroll to the services and about sections.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, shows a loading spinner during login, and displays the user's display name when authenticated.",
  "frontend/src/components/MonthlyPackagesSection.tsx": "Renders a grid of three monthly subscription PackageCards (Basic, Premium, Pro) with their features and prices, forwarding subscribe click events.",
  "frontend/src/components/OneTimeServicesSection.tsx": "Renders a grid of four one-time ServiceCards (video editing/shoot and delivery shoots) with prices, forwarding book click events.",
  "frontend/src/components/PackageCard.tsx": "Displays a single subscription package card with name, price, feature checklist, an optional 'Most Popular' badge, and a subscribe button.",
  "frontend/src/components/PricingSection.tsx": "Renders the pricing section with one-time services and monthly packages, managing a booking modal state that opens when a service is selected.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to enter their display name and optional email, saving the profile via mutation and calling onComplete on success.",
  "frontend/src/components/ServiceCard.tsx": "Displays a single service card with an icon, name, description, price, and a 'Book Now' button that triggers the onBookClick callback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context and provider, handling AuthClient creation, login, logout, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and bookings against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining a cinematic dark theme with gold accent CSS custom properties, Tailwind layers, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard page showing a login prompt for unauthenticated users or a personalized view with booking history and profile info for authenticated users.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page component that composes Header, HeroSection, AboutSection, PricingSection, and Footer, and shows a ProfileSetupModal for first-time users after Internet Identity login.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Bebas Neue, Playfair Display, Inter), an extended color palette using oklch CSS variables (gold, surface, chart, sidebar), custom shadows, border radii, and animation keyframes.",
  "project_state.json": "Project state manifest for 'Himachali Editor', a videography service website, tracking schema version, architectural notes, implemented features (cinematic theme, landing page, one-time and monthly pricing, customer auth), and required image assets."
}